CSI API ETABS v1

# cCaseResponseSpectrumGetEccentricity Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetEccentricity(
    	string Name,
    	ref double Eccen
    )

    Function GetEccentricity (
    	Name As String,
    	ByRef Eccen As Double
    ) As Integer

    Dim instance As cCaseResponseSpectrum
    Dim Name As String
    Dim Eccen As Double
    Dim returnValue As Integer

    returnValue = instance.GetEccentricity(Name,
    	Eccen)

    int GetEccentricity(
    	String^ Name,
    	double% Eccen
    )

    abstract GetEccentricity :
            Name : string *
            Eccen : float byref -> int

#### Parameters

Name

    Type: SystemString

Eccen

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cCaseResponseSpectrum Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com